#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.ethical_jobs_cloudbuild_stg will be created
  + resource "google_storage_bucket" "ethical_jobs_cloudbuild_stg" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "ethical-jobs-cloudbuild-stg-test"
      + project                     = "pod-n-shubham-awasthi"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket.ethical_jobs_cloudbuild_stg-03062022 will be created
  + resource "google_storage_bucket" "ethical_jobs_cloudbuild_stg-03062022" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "ethical-jobs-cloudbuild-stg-03062022"
      + project                     = "pod-n-shubham-awasthi"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket.ethical_jobs_cloudbuild_stg-new will be created
  + resource "google_storage_bucket" "ethical_jobs_cloudbuild_stg-new" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "ethical-jobs-cloudbuild-stg-test-new"
      + project                     = "pod-n-shubham-awasthi"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket.ethical_jobs_web_files_stg will be created
  + resource "google_storage_bucket" "ethical_jobs_web_files_stg" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "AUSTRALIA-SOUTHEAST1"
      + name                        = "ethical-jobs-web-files-stg-test"
      + project                     = "pod-n-shubham-awasthi"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # google_storage_bucket.terraform_state_ej_stg will be created
  + resource "google_storage_bucket" "terraform_state_ej_stg" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "AUSTRALIA-SOUTHEAST1"
      + name                        = "terraform-state-ej-stg-test"
      + project                     = "pod-n-shubham-awasthi"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @shubham061292, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - CD`*